# Лабораторная 1-1. Первая программа   
Изучаемые темы: точка входа в программу, подключение библиотек, ввод/вывод на экран (cin, cout)

### Теория
[Hello, World!](https://github.com/StriderAJR/StudentCpp/wiki/Hello,-World!)

### Пример

```C++
#include <iostream>
using namespace std;

int main()
{
    cout << "Hello!" << endl 
        << "It's my first C++." << endl << endl 
        << "I promise Yoda will be proud of me.";
        
    return 0;
}
```

### Приступая к работе...
1. Что такое проект
1. С чего начинается программа, точка входа в программу
1. Что такое `include`
1. Почему перед ним стоит значок `#`
1. Что такое "using namespace std;" Что такое using, что такое namespace, что такое std.
1. Что будет если убрать строчку "using namespace std;" Почему? Как исправить программу, чтобы она работала без этой строчки.
1. Что такое main. Почему перед ней стоит int. Может ли вместо int стоять что-то другое? Что? Нужно ли будет как-то изменить программу.
1. Что такое "return 0;" Зачем оно нужно.
1. Что такое cout?
1. Что такое "<<".
1. Что такое endl.

### Задание
1. Создать проект
1. Написать программу, которая выводит на экран "Hello, World"
1. Изменить программу так, чтобы программа выводила "Hello, %user_name%", где вместо %user_name% вставить свое имя
