# Наследование
Темы для отработки: наследование, виртуальные методы

## Задание
На основе предложенного описания составить систему классов и привести пример работы системы.
Подсказка: в каждом варианте обязательно зашифровано наследование.

### Дополнительные баллы 
Доп. баллы начисляются за грамотное использование полиморфизма

### Что будет оцениваться
То же, что и в 5 работе

## Варианты
### Симулятор олигарха
Разбогатев на сети баров, вы решили расширяться. Теперь вы владеете не только барами, но ресторанами, фаст-фуд забегаловками и фургончиках на колесах. Соответственно в мире вы не один такой олигарх.

У каждого олигарха есть перечень его имущества - баров, ресторанов и так далее. Каждый объект недвижимости имеет фактический адрес, сумму, которая была потрачена на открытие этого объекта, сумму чистого дохода, который этот объект заработал и процент накрутки (в фургончике накрутка минимальна, в ресторане - максимальна)

Но у этих объектов есть и отличия:
ресторан имеет "звездность" - кол-во звезд, символизирующих уровень ресторана
бар - алкогольный индекс, который показывает на крепость подаваемых напитков в баре (есть "пивные", коктейльные, "крепкие" быра и т.п.)
фаст-фуд - название акции, которая действует в забегаловке в данный момент,
фургончик на колесах - уровень "проблемности", то сколько раз РосПотребНадзор привлекал этот фургончик за нарушение правил гигиены.

Соответственно каждый день все типы заведений обслуживают своих клиентов. Клиент приходит, делает заказ и расплачивается за него.

Покажите один день из жизни нескольких олигархов.

### Банк

### Поликлиника

### Генеалогическое древо

### Цветочный магазин

### Прайс товаров

### This Is War!

### Аэропорт

### Цифровой магазин

### Game dev
