# Лабораторная 1-1. Первая программа   
Изучаемые темы: точка входа в программу, работа с IDE

### Теория
[Hello, World!](https://github.com/StriderAJR/StudentCpp/wiki/Hello,-World!)

### Пример

```C++
#include <iostream>
using namespace std;

int main()
{
    cout << "Hello, World!";
        
    return 0;
}
```

### Приступая к работе...
1. Что такое проект
1. С чего начинается программа, точка входа в программу
1. Научиться слушать более опытных и верить им **иногда** на слово

### Задание
1. Создать проект
1. Написать программу, которая выводит на экран "Hello, World"
1. Изменить программу так, чтобы программа выводила "Hello, %user_name%", где вместо %user_name% вставить свое имя
